In [7]:
import sqlite3

# 创建或连接到一个SQLite数据库
conn = sqlite3.connect('python_sql.db')

# 创建一个游标对象
cur = conn.cursor()

# 执行查询语句
cur.execute("SELECT * FROM TableA")

# 获取并打印所有结果
rows = cur.fetchall()
for row in rows:
    print(row)

# 关闭连接
conn.close()

(1, 'Apple', '2021-01-01', 'M', 24.5)
(2, 'Apple', '2022-02-02', 'F', 15.3)
(3, 'Banana', '2023-03-03', 'M', 68.7)
(4, 'Banana', '2024-04-04', 'F', 31.4)
(5, 'Cherry', '2021-01-01', 'M', 13.1)
(6, 'Apple', '2021-01-01', 'F', 47.9)
(7, 'Cherry', '2023-03-03', 'M', 33.3)
(8, 'Apple', '2022-02-02', 'F', 56.7)
(9, 'Cherry', '2021-01-01', 'M', 25.5)
(10, 'Banana', '2024-04-04', 'F', 15.6)
(11, 'Apple', '2021-01-01', 'M', 68.1)
(12, 'Cherry', '2023-03-03', 'F', 31.7)
(13, 'Apple', '2024-04-04', 'M', 13.9)
(14, 'Banana', '2021-01-01', 'F', 47.3)
(15, 'Cherry', '2022-02-02', 'M', 33.5)
(16, 'Apple', '2023-03-03', 'F', 59.7)
(17, 'Banana', '2024-04-04', 'M', 27.7)
(18, 'Banana', '2021-01-01', 'F', 15.6)
(19, 'Cherry', '2022-02-02', 'M', 68.8)
(20, 'Apple', '2023-03-03', 'F', 31.4)

In [8]:
conn = sqlite3.connect('python_sql.db')
cur = conn.cursor()
import pandas as pd
df = pd.read_sql_query("SELECT * FROM TableA", conn)
df.head(10)

   Field1  Field2      Field3 Field4  Field5
0       1   Apple  2021-01-01      M    24.5
1       2   Apple  2022-02-02      F    15.3
2       3  Banana  2023-03-03      M    68.7
3       4  Banana  2024-04-04      F    31.4
4       5  Cherry  2021-01-01      M    13.1
5       6   Apple  2021-01-01      F    47.9
6       7  Cherry  2023-03-03      M    33.3
7       8   Apple  2022-02-02      F    56.7
8       9  Cherry  2021-01-01      M    25.5
9      10  Banana  2024-04-04      F    15.6

In [9]:
df = pd.read_sql_query("SELECT sum(Field1) as S1 FROM TableA group by Field2,Field3", conn)
df.head()

   S1
0  18
1  10
2  36
3  13
4  32

In [10]:
df = pd.read_sql_query("SELECT Field2,Field3,sum(Field1) as S1 FROM TableA group by Field2,Field3", conn)
df

   Field2      Field3  S1
0   Apple  2021-01-01  18
1   Apple  2022-02-02  10
2   Apple  2023-03-03  36
3   Apple  2024-04-04  13
4  Banana  2021-01-01  32
5  Banana  2023-03-03   3
6  Banana  2024-04-04  31
7  Cherry  2021-01-01  14
8  Cherry  2022-02-02  34
9  Cherry  2023-03-03  19

In [11]:
df = pd.read_sql_query("SELECT Field2,Field3,sum(Field1) as S1 FROM TableA group by Field2", conn)
df

   Field2      Field3  S1
0   Apple  2021-01-01  77
1  Banana  2023-03-03  66
2  Cherry  2021-01-01  67